app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
WHERE `id_user` = '4'
---
    public function DetailData($id_user)
    {
        return $this->db->table('tbl_user')
                ->where('id_user', $id_user)
                ->get()->getRowArray();