app/Models/ModelBengkel.php

    public function AllData()
    {
        return $this->db->table('tbl_bengkel')
                ->get()->getResultArray();
---
SELECT *
FROM `tbl_bengkel`