app/Models/ModelWilayah.php

SELECT *
FROM `tbl_wilayah`
---
    public function AllData()
    {
        return $this->db->table('tbl_wilayah')
                ->get()->getResultArray();

INSERT INTO `tbl_wilayah` (`nama_wilayah`, `warna`, `geojson`) VALUES ('avgvsax', '#951EBE', 'b sx sx')
---
    public function InsertData($data)
    {
        $this->db->table('tbl_wilayah')->insert($data);

SELECT *
FROM `tbl_wilayah`
WHERE `id_wilayah` = '2'
---
    public function DetailData($id_wilayah)
    {
        return $this->db->table('tbl_wilayah')
                ->where('id_wilayah', $id_wilayah)
                ->get()->getRowArray();