app/Models/ModelBengkel.php

    public function DetailData($id_bengkel)
    {
        return $this->db->table('tbl_bengkel')
             ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_bengkel.id_kategori', 'left')
             ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_bengkel.id_provinsi', 'left')
             ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_bengkel.id_kabupaten', 'left')
             ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_bengkel.id_kecamatan', 'left')
             ->join('tbl_wilayah', 'tbl_wilayah.id_wilayah = tbl_bengkel.id_wilayah', 'left')
                ->where('id_bengkel', $id_bengkel)
                ->get()->getRowArray();
---
SELECT *
FROM `tbl_bengkel`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_bengkel`.`id_kategori`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_bengkel`.`id_provinsi`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_bengkel`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_bengkel`.`id_kecamatan`
WHERE `id_bengkel` = '1'

    public function UpdateData($data)
    {
        $this->db->table('tbl_bengkel')
        ->where('id_bengkel', $data['id_bengkel'])
        ->update($data);
---
UPDATE `tbl_bengkel` SET `id_bengkel` = '4', `nama_bengkel` = 'Arta Jaya Motor', `jam_buka` = '00:00:08', `jam_tutup` = '00:00:18', `id_kategori` = 'MOTOR', `coordinat` = '-7.239342443732098,109.00970353891734', `id_provinsi` = '33', `id_kabupaten` = '3329', `id_kecamatan` = '3329030', `alamat` = 'Jl. Pangeran Diponegoro No.215, Karangtuang, Dukuhturi', `id_wilayah` = '1', `foto` = '1781263731_8dec8d03c802706d1575.png'
WHERE `id_bengkel` = '4'

    public function allProvinsi()
    {
        return $this->db->table('tbl_provinsi')
                ->orderBy('id_provinsi', 'ASC')
                ->get()->getResultArray();
---
SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC

    public function allKabupaten($id_provinsi)
    {
        return $this->db->table('tbl_kabupaten')
                ->where('id_provinsi', $id_provinsi)
                ->get()->getResultArray();
---
SELECT *
FROM `tbl_kabupaten`
WHERE `id_provinsi` = '13'

    public function allKecamatan($id_kabupaten)
    {
        return $this->db->table('tbl_kecamatan')
            ->where('id_kabupaten', $id_kabupaten)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kecamatan`
WHERE `id_kabupaten` = '3329'