app/Views/v_dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_wilayah`
SELECT COUNT(*) AS `numrows`
FROM `tbl_bengkel`
SELECT COUNT(*) AS `numrows`
FROM `tbl_kategori`
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`
---
$db = \Config\Database::connect();

// Hitung total data langsung (Sesuaikan nama tabel jika berbeda)
$total_wilayah  = $db->table('tbl_wilayah')->countAllResults();
$total_bengkel  = $db->table('tbl_bengkel')->countAllResults();
$total_kategori = $db->table('tbl_kategori')->countAllResults();
$total_users    = $db->table('tbl_user')->countAllResults();

SELECT `k`.`kategori` as `label`, COUNT(b.id_bengkel) as jumlah
FROM `tbl_bengkel` `b`
LEFT JOIN `tbl_kategori` `k` ON `k`.`id_kategori` = `b`.`id_kategori`
GROUP BY `k`.`kategori`
ORDER BY `jumlah` DESC
---
// Distribusi bengkel per kategori (untuk chart). Sesuaikan nama kolom relasi bila berbeda.
$kategori_chart = [];
try {
    $kategori_chart = $db->table('tbl_bengkel b')
        ->select('k.kategori as label, COUNT(b.id_bengkel) as jumlah')
        ->join('tbl_kategori k', 'k.id_kategori = b.id_kategori', 'left')
        ->groupBy('k.kategori')
        ->orderBy('jumlah', 'DESC')
        ->get()->getResultArray();

SELECT `w`.`nama_wilayah` as `label`, COUNT(b.id_bengkel) as jumlah
FROM `tbl_bengkel` `b`
LEFT JOIN `tbl_wilayah` `w` ON `w`.`id_wilayah` = `b`.`id_wilayah`
GROUP BY `w`.`nama_wilayah`
ORDER BY `jumlah` DESC
---
// Distribusi bengkel per wilayah (untuk chart)
$wilayah_chart = [];
try {
    $wilayah_chart = $db->table('tbl_bengkel b')
        ->select('w.nama_wilayah as label, COUNT(b.id_bengkel) as jumlah')
        ->join('tbl_wilayah w', 'w.id_wilayah = b.id_wilayah', 'left')
        ->groupBy('w.nama_wilayah')
        ->orderBy('jumlah', 'DESC')
        ->get()->getResultArray();